// 1.Создайте страницу, которая спрашивает имя и выводит его.
// var yourName = prompt('What is your name?');
//alert(yourName);


// 2. Выведется ли alert?
//if ("0") {
//  alert( 'Привет' );
//} // да, так как в данном случае будет true 

// 3.
//var JavaName = prompt('Каково "официальное" название JavaScript?');
//if (JavaName == 'ECMAScript') {
//    alert('Верно!');
//} else {
//    alert('Не знаете? ECMAScript!');
//}

// 4. Используя конструкцию if..else, напишите код, который получает значение prompt, а затем выводит alert:
//var Number = prompt('Введите число');
//if (Number > 0) {
//    alert('1');
//} if (Number < 0) {
//    alert('-1');
//} else {
//    alert('0');
//}


// 5. Проверка логина
//var Admin = prompt('Кто пришел?');
//if (Admin == 'Админ') {
//    alert('Верно!');
//
//   var pass = prompt('Введите пароль')
//   
//   if (pass == 'Чёрный Властелин') {
//      alert('Добро пожаловать!')
//   } else if (pass == '') {
//      alert('Неверный пароль')
//   } else {
//       alert('Вход отменен')
//   }
//}
//else if (Admin == '') {
//    alert('Вход отменен!');
//} else {
//    alert('Я вас не знаю');
//}


// 6. Перепишите if с использованием оператора '?':
 
//if (a + b < 4) {
//  result = 'Мало';
//} else {
//  result = 'Много';
//}
//result = (a + b < 4) ? 'Мало' : 'Много';
//

// 7.Перепишите if..else с использованием нескольких операторов '?'.

//var message = (login == 'Вася') ? 'Привет' :
//  (login == 'Директор') ? 'Здравствуйте' :
//  (login == '') ? 'Нет логина' : '';


